package org.dooger1.russiandatagenerator.generator.address;

import org.dooger1.russiandatagenerator.base.DataGenerator;

import java.util.Random;

public class StreetGenerator implements DataGenerator<String> {
    private static final String[] STREETS = {
            "Береговая", "Берёзовая", "Бульварная", "Волгоградская", "Восточная", "Гагарина", "Гвардейская", "Горная",
            "Горького", "Дачная", "Декабристов", "Дружбы", "Есенина", "Западная", "Заречная", "Зелёная", "Калинина",
            "Карла Маркса", "Кирова", "Колхозная", "Комсомольская", "Ленина", "Лесная", "Маяковского", "Механизаторов",
            "Мира", "Мичурина", "Мичуринская", "Молодёжная", "Мостовая", "Набережная", "Новая", "Озерная", "Октябрьская",
            "Парковая", "Первомайская", "Песчаная", "Пионерская", "Пролетарская", "Промышленная", "Профсоюзная", "Пушкина",
            "Рабочая", "Радужная", "Революционная", "Речная", "Ромашковая", "Садовая", "Свободы", "Северная", "Сельская",
            "Сиреневая", "Советская", "Солнечная", "Сосновая", "Спортивная", "Строителей", "Суворова", "Тихая", "Трактовая",
            "Транспортная", "Труда", "Тургенева", "Уральская", "Фабричная", "Фестивальная", "Фрунзе", "Центральная",
            "Чапаева", "Чкалова", "Школьная", "Энергетиков", "Юбилейная", "Южная", "Ягодная"
    };
    private final Random random = new Random();

    @Override
    public String generate() {
        return "ул. " + STREETS[random.nextInt(STREETS.length)];
    }
}
